Catalogs/НастройкиИнтеграцииМаркетплейс/НастройкиИнтеграцииМаркетплейс.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>НастройкиИнтеграцииМаркетплейс</name>
  <owners>Catalog.Организации</owners>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидМаркетплейса</name>
    <type>
      <types>EnumRef.ВидыМаркетплейсов</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеСклада</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторСклада</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторКабинета</name>
    <comment>businessID на Яндекс.Маркет</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КаталогЗагружен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлатежныйАгент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорПлатежногоАгента</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаАвтозагрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СкладыМаркетплейс</name>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСклада</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторКабинета</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипСклада</name>
      <type>
        <types>EnumRef.ТипыСкладовМаркетплейс</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИсторияКонтрагентаДоговора</name>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ДоговорКонтрагента</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Enums/ВидыМаркетплейсов/ВидыМаркетплейсов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыМаркетплейсов</name>
  <enumValues>
    <name>Wildberries</name>
  </enumValues>
  <enumValues>
    <name>OZON</name>
  </enumValues>
  <enumValues>
    <name>ЯндексМаркет</name>
  </enumValues>
  <enumValues>
    <name>Мегамаркет</name>
  </enumValues>
</mdclass:Enum>

Catalogs/НастройкиИнтеграцииМаркетплейс/Forms/ФормаСписка/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ВидМаркетплейса") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			Список, "ВидМаркетплейса", Параметры.ВидМаркетплейса, ВидСравненияКомпоновкиДанных.Равно,,Истина);
		Элементы.ДобавитьПодключение.Вид = ВидГруппыФормы.ГруппаКнопок;
		Элементы.ФормаДобавитьOzon.Видимость   = (Параметры.ВидМаркетплейса = Перечисления.ВидыМаркетплейсов.OZON);
		Элементы.ФормаДобавитьWB.Видимость     = (Параметры.ВидМаркетплейса = Перечисления.ВидыМаркетплейсов.Wildberries);
		Элементы.ФормаДобавитьЯндекс.Видимость = (Параметры.ВидМаркетплейса = Перечисления.ВидыМаркетплейсов.ЯндексМаркет);
	КонецЕсли;
	
	Если Параметры.Свойство("СкрытьАвтозагрузку") Тогда
		СкрытьАвтозагрузку = Параметры.СкрытьАвтозагрузку;
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьOzon(Команда)
	
	ОткрытьНастройкуМаркетплейса(ПредопределенноеЗначение("Перечисление.ВидыМаркетплейсов.OZON"));
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьWB(Команда)
	
	ОткрытьНастройкуМаркетплейса(ПредопределенноеЗначение("Перечисление.ВидыМаркетплейсов.Wildberries"));
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьЯндекс(Команда)
	
	ОткрытьНастройкуМаркетплейса(ПредопределенноеЗначение("Перечисление.ВидыМаркетплейсов.ЯндексМаркет"));
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНастройкуМаркетплейса(Маркетплейс)
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("ВидМаркетплейса", Маркетплейс);
	Если СкрытьАвтозагрузку Тогда
		ПараметрыФормы.Вставить("СкрытьАвтозагрузку", Истина);
	КонецЕсли;
		
	ОткрытьФорму("Справочник.НастройкиИнтеграцииМаркетплейс.ФормаОбъекта", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры
